jantielens/esp32-template-wifi/src/app/image_api.cpp
/*
 * Image API Implementation
 * 
 * REST API handlers for uploading and displaying JPEG images.
 * Uses backend adapter pattern for portability across projects.
 */

#include "board_config.h"

#if HAS_IMAGE_API

#include "image_api.h"
#include "jpeg_preflight.h"
#include "log_manager.h"
#include "device_telemetry.h"

#include <Arduino.h>
#include <ESPAsyncWebServer.h>

#include <esp_heap_caps.h>
#include <soc/soc_caps.h>

static void* image_api_alloc(size_t size) {
    if (size == 0) return nullptr;

#if SOC_SPIRAM_SUPPORTED
    // Prefer PSRAM to reduce internal heap pressure when available.
    void* p = heap_caps_malloc(size, MALLOC_CAP_SPIRAM);
    if (p) return p;
#endif

    // Fallback: internal 8-bit heap.
    return heap_caps_malloc(size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
}

static void image_api_free(void* p) {
    if (!p) return;
    heap_caps_free(p);
}

// ===== Constants =====

// Note: AsyncWebServer callbacks run on the AsyncTCP task. Do not block
// (e.g., with delay()/busy waits). If we're busy, return 409 and let the
// client retry.

// ===== Internal state =====

static ImageApiConfig g_cfg;
static ImageApiBackend g_backend = {nullptr, nullptr, nullptr};

// Image upload buffer (allocated temporarily during upload)
static uint8_t* image_upload_buffer = nullptr;
static size_t image_upload_size = 0;
static unsigned long image_upload_timeout_ms = 10000;

// Upload state tracking
enum UploadState {
    UPLOAD_IDLE = 0,
    UPLOAD_IN_PROGRESS,
    UPLOAD_READY_TO_DISPLAY
};
static volatile UploadState upload_state = UPLOAD_IDLE;
static volatile unsigned long pending_op_id = 0;  // Incremented when new op is queued

// Pending image display operation (processed by main loop)
struct PendingImageOp {
    uint8_t* buffer;
    size_t size;
    bool dismiss;  // true = dismiss current image, false = show new image
    unsigned long timeout_ms;  // Display timeout in milliseconds
    unsigned long start_time;  // Time when upload completed (for accurate timeout)
};
static PendingImageOp pending_image_op = {nullptr, 0, false, 10000, 0};

// Strip upload state (buffering during HTTP upload)
static uint8_t* current_strip_buffer = nullptr;
static size_t current_strip_size = 0;

// Strip processing state (async decode queue)
struct PendingStripOp {
    uint8_t* buffer;
    size_t size;
    uint8_t strip_index;
    int image_width;
    int image_height;
    int total_strips;
    unsigned long timeout_ms;
    unsigned long start_time;
};
static PendingStripOp pending_strip_op = {nullptr, 0, 0, 0, 0, 0, 10000, 0};

static bool is_jpeg_magic(const uint8_t* buf, size_t sz) {
    return (buf && sz >= 3 && buf[0] == 0xFF && buf[1] == 0xD8 && buf[2] == 0xFF);
}

static unsigned long parse_timeout_ms(AsyncWebServerRequest* request) {
    // Parse optional timeout parameter from query string (e.g., ?timeout=30)
    unsigned long timeout_seconds = g_cfg.default_timeout_ms / 1000;
    if (request->hasParam("timeout")) {
        String timeout_str = request->getParam("timeout")->value();
        timeout_seconds = (unsigned long)timeout_str.toInt();
        // Clamp to prevent overflow and respect max timeout
        unsigned long max_seconds = g_cfg.max_timeout_ms / 1000;
        if (timeout_seconds > max_seconds) timeout_seconds = max_seconds;
    }
    return timeout_seconds * 1000UL;
}

// ===== Handlers =====

// POST /api/display/image - Upload and display JPEG image (deferred decode)
static void handleImageUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    (void)filename;

    // First chunk - initialize upload
    if (index == 0) {
        // If upload already in progress OR pending display, reject (client can retry)
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Upload busy\"}");
            return;
        }

        Logger.logBegin("Image Upload");
        Logger.logLinef("Total size: %u bytes", request->contentLength());

        image_upload_timeout_ms = parse_timeout_ms(request);
        Logger.logLinef("Timeout: %lu ms", image_upload_timeout_ms);

        device_telemetry_log_memory_snapshot("img pre-clear");

        // Free any pending image buffer to make room for new upload
        if (pending_image_op.buffer) {
            Logger.logMessage("Upload", "Freeing pending image buffer");
            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
        }

        device_telemetry_log_memory_snapshot("img post-clear");

        // Check file size
        size_t total_size = request->contentLength();
        if (total_size > g_cfg.max_image_size_bytes) {
            Logger.logEnd("ERROR: Image too large");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Image too large\"}");
            return;
        }

        // Check memory availability.
        // - The upload buffer is allocated via image_api_alloc(), which prefers PSRAM when supported.
        // - The decode pipeline still needs some internal (8-bit) heap headroom.
        const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        const size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);

#if SOC_SPIRAM_SUPPORTED
        const size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
        const size_t psram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
        const bool psram_can_hold_upload = (psram_free >= total_size) && (psram_largest >= total_size);
#else
        const size_t psram_free = 0;
        const size_t psram_largest = 0;
        const bool psram_can_hold_upload = false;
#endif

        // Always require internal headroom for decoding/processing.
        const bool internal_has_headroom = internal_free >= g_cfg.decode_headroom_bytes;
        if (!internal_has_headroom) {
            Logger.logLinef(
                "ERROR: Insufficient internal memory for decode headroom (need %u, have %u)",
                (unsigned)g_cfg.decode_headroom_bytes,
                (unsigned)internal_free
            );
            device_telemetry_log_memory_snapshot("img insufficient");
            char error_msg[240];
            snprintf(
                error_msg,
                sizeof(error_msg),
                "{\"success\":false,\"message\":\"Insufficient internal memory: need %uKB decode headroom, have %uKB.\"}",
                (unsigned)(g_cfg.decode_headroom_bytes / 1024),
                (unsigned)(internal_free / 1024)
            );
            Logger.logEnd();
            request->send(507, "application/json", error_msg);
            return;
        }

        // If PSRAM can't hold the upload buffer, we'll fall back to internal allocation;
        // in that case we must have total_size + headroom available, and a contiguous block.
        if (!psram_can_hold_upload) {
            const size_t required_internal = total_size + g_cfg.decode_headroom_bytes;
            if (internal_free < required_internal || internal_largest < total_size) {
                Logger.logLinef(
                    "ERROR: Insufficient memory (need %u internal, have %u; largest %u; psram_free %u largest %u)",
                    (unsigned)required_internal,
                    (unsigned)internal_free,
                    (unsigned)internal_largest,
                    (unsigned)psram_free,
                    (unsigned)psram_largest
                );
                device_telemetry_log_memory_snapshot("img insufficient");
                char error_msg[300];
                snprintf(
                    error_msg,
                    sizeof(error_msg),
                    "{\"success\":false,\"message\":\"Insufficient memory: need %uKB internal, have %uKB (largest block %uKB).\"}",
                    (unsigned)(required_internal / 1024),
                    (unsigned)(internal_free / 1024),
                    (unsigned)(internal_largest / 1024)
                );
                Logger.logEnd();
                request->send(507, "application/json", error_msg);
                return;
            }
        }

        // Allocate buffer
        device_telemetry_log_memory_snapshot("img pre-alloc");
        image_upload_buffer = (uint8_t*)image_api_alloc(total_size);
        if (!image_upload_buffer) {
            Logger.logEnd("ERROR: Memory allocation failed");
            device_telemetry_log_memory_snapshot("img alloc-fail");
            request->send(507, "application/json", "{\"success\":false,\"message\":\"Memory allocation failed\"}");
            return;
        }
        device_telemetry_log_memory_snapshot("img post-alloc");

        image_upload_size = 0;
        upload_state = UPLOAD_IN_PROGRESS;
    }

    // Receive data chunks
    if (len && image_upload_buffer && upload_state == UPLOAD_IN_PROGRESS) {
        memcpy(image_upload_buffer + image_upload_size, data, len);
        image_upload_size += len;

        // Log progress every 10KB
        static size_t last_logged_size = 0;
        if (image_upload_size - last_logged_size >= 10240) {
            Logger.logLinef("Received: %u bytes", image_upload_size);
            last_logged_size = image_upload_size;
        }
    }

    // Final chunk - validate and queue for display
    if (final) {
        if (image_upload_buffer && image_upload_size > 0 && upload_state == UPLOAD_IN_PROGRESS) {
            Logger.logLinef("Upload complete: %u bytes", image_upload_size);

            if (!is_jpeg_magic(image_upload_buffer, image_upload_size)) {
                Logger.logLinef("Invalid header: %02X %02X %02X %02X",
                                image_upload_buffer[0], image_upload_buffer[1],
                                image_upload_buffer[2], image_upload_buffer[3]);
                Logger.logEnd("ERROR: Not a valid JPEG file");
                image_api_free(image_upload_buffer);
                image_upload_buffer = nullptr;
                image_upload_size = 0;
                upload_state = UPLOAD_IDLE;
                request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JPEG file\"}");
                return;
            }

            // Best-effort header preflight so we can return a descriptive 400 before queuing
            char preflight_err[160];
            if (!jpeg_preflight_tjpgd_supported(
                    image_upload_buffer,
                    image_upload_size,
                    g_cfg.lcd_width,
                    g_cfg.lcd_height,
                    preflight_err,
                    sizeof(preflight_err))) {
                Logger.logLinef("ERROR: JPEG preflight failed: %s", preflight_err);
                Logger.logEnd();
                image_api_free(image_upload_buffer);
                image_upload_buffer = nullptr;
                image_upload_size = 0;
                upload_state = UPLOAD_IDLE;

                char resp[256];
                snprintf(resp, sizeof(resp), "{\"success\":false,\"message\":\"%s\"}", preflight_err);
                request->send(400, "application/json", resp);
                return;
            }

            // Queue image for display by main loop (deferred operation)
            if (pending_image_op.buffer) {
                Logger.logMessage("Upload", "Replacing pending image");
                image_api_free((void*)pending_image_op.buffer);
            }

