jantielens/esp32-template-wifi/src/app/image_api.cpp
            pending_image_op.buffer = image_upload_buffer;
            pending_image_op.size = image_upload_size;
            pending_image_op.dismiss = false;
            pending_image_op.timeout_ms = image_upload_timeout_ms;
            pending_image_op.start_time = millis();
            pending_op_id++;
            upload_state = UPLOAD_READY_TO_DISPLAY;

            // main loop owns the buffer now
            image_upload_buffer = nullptr;
            image_upload_size = 0;

            Logger.logEnd("Image queued for display");

            char response_msg[160];
            snprintf(response_msg, sizeof(response_msg),
                     "{\"success\":true,\"message\":\"Image queued for display (%lus timeout)\"}",
                     (unsigned long)(image_upload_timeout_ms / 1000));
            request->send(200, "application/json", response_msg);
        } else {
            Logger.logEnd("ERROR: No data received");
            upload_state = UPLOAD_IDLE;
            request->send(400, "application/json", "{\"success\":false,\"message\":\"No data received\"}");
        }
    }
}

// DELETE /api/display/image - Manually dismiss image
static void handleImageDelete(AsyncWebServerRequest *request) {
    Logger.logMessage("Portal", "Image dismiss requested");

    if (pending_image_op.buffer) {
        image_api_free((void*)pending_image_op.buffer);
    }
    pending_image_op.buffer = nullptr;
    pending_image_op.size = 0;
    pending_image_op.dismiss = true;
    upload_state = UPLOAD_READY_TO_DISPLAY;
    pending_op_id++;

    request->send(200, "application/json", "{\"success\":true,\"message\":\"Image dismiss queued\"}");
}

// POST /api/display/image/strips?strip_index=N&strip_count=T&width=W&height=H[&timeout=seconds]
// Upload a single JPEG strip; decode is deferred to the main loop.
static void handleStripUpload(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    // Validate required params
    if (index == 0) {
        const bool has_required =
            request->hasParam("strip_index", false) &&
            request->hasParam("strip_count", false) &&
            request->hasParam("width", false) &&
            request->hasParam("height", false);

        if (!has_required) {
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Missing required parameters: strip_index, strip_count, width, height\"}");
            return;
        }
    }

    if (!request->hasParam("strip_index", false) || !request->hasParam("strip_count", false) ||
        !request->hasParam("width", false) || !request->hasParam("height", false)) {
        request->send(400, "application/json", "{\"success\":false,\"message\":\"Missing required parameters: strip_index, strip_count, width, height\"}");
        return;
    }

    const int stripIndex = request->getParam("strip_index", false)->value().toInt();
    const int totalStrips = request->getParam("strip_count", false)->value().toInt();
    const int imageWidth = request->getParam("width", false)->value().toInt();
    const int imageHeight = request->getParam("height", false)->value().toInt();
    const unsigned long timeoutMs = request->hasParam("timeout", false)
        ? (unsigned long)request->getParam("timeout", false)->value().toInt() * 1000UL
        : g_cfg.default_timeout_ms;

    if (index == 0) {
        // Reject if we're busy. AsyncWebServer runs on AsyncTCP task; do not block.
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY || pending_strip_op.buffer) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}");
            return;
        }

        // Only log first strip to reduce verbosity
        if (stripIndex == 0) {
            Logger.logMessagef("Strip Mode", "Uploading %dx%d image (%d strips)", imageWidth, imageHeight, totalStrips);
            device_telemetry_log_memory_snapshot("strip pre-alloc");
        }

        if (stripIndex < 0 || stripIndex >= totalStrips) {
            Logger.logEnd("ERROR: Invalid strip index");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid strip index\"}");
            return;
        }

        if (imageWidth <= 0 || imageHeight <= 0 || imageWidth > g_cfg.lcd_width || imageHeight > g_cfg.lcd_height) {
            Logger.logLinef("ERROR: Invalid dimensions %dx%d", imageWidth, imageHeight);
            Logger.logEnd();
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid image dimensions\"}");
            return;
        }

        if (current_strip_buffer) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
        }

        current_strip_buffer = (uint8_t*)image_api_alloc(total);
        if (!current_strip_buffer) {
            Logger.logLinef("ERROR: Out of memory (requested %u bytes, free heap: %u)", (unsigned)total, ESP.getFreeHeap());
            device_telemetry_log_memory_snapshot("strip alloc-fail");
            Logger.logEnd();
            request->send(507, "application/json", "{\"success\":false,\"message\":\"Out of memory\"}");
            return;
        }

        current_strip_size = 0;
    }

    if (current_strip_buffer && current_strip_size + len <= total) {
        memcpy((uint8_t*)current_strip_buffer + current_strip_size, data, len);
        current_strip_size += len;
    }

    // Final chunk: decode synchronously before returning
    if (index + len >= total) {
        if (current_strip_size != total) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(500, "application/json", "{\"success\":false,\"message\":\"Incomplete upload\"}");
            return;
        }

        if (!is_jpeg_magic(current_strip_buffer, current_strip_size)) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JPEG data\"}");
            return;
        }

        // Best-effort header preflight
        char preflight_err[160];
        const int remaining_height = imageHeight;
        if (!jpeg_preflight_tjpgd_fragment_supported(
                current_strip_buffer,
                current_strip_size,
                imageWidth,
                remaining_height,
                g_cfg.lcd_height,
                preflight_err,
                sizeof(preflight_err))) {
            Logger.logLinef("ERROR: JPEG fragment preflight failed: %s", preflight_err);
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();

            char resp[256];
            snprintf(resp, sizeof(resp), "{\"success\":false,\"message\":\"%s\"}", preflight_err);
            request->send(400, "application/json", resp);
            return;
        }

