jantielens/esp32-template-wifi/src/app/image_api.cpp
        // Queue strip for async decode (don't decode in HTTP handler)
        // If we're busy, reject and let client retry.
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY || pending_strip_op.buffer) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}" );
            return;
        }

        // Transfer strip buffer to pending operation
        upload_state = UPLOAD_IN_PROGRESS;
        pending_strip_op.buffer = current_strip_buffer;
        pending_strip_op.size = current_strip_size;
        pending_strip_op.strip_index = (uint8_t)stripIndex;
        pending_strip_op.image_width = imageWidth;
        pending_strip_op.image_height = imageHeight;
        pending_strip_op.total_strips = totalStrips;
        pending_strip_op.timeout_ms = timeoutMs;
        pending_strip_op.start_time = millis();
        
        current_strip_buffer = nullptr;
        current_strip_size = 0;
        
        upload_state = UPLOAD_READY_TO_DISPLAY;
        pending_op_id++;
        
        Logger.logMessagef("Strip", "Strip %d/%d queued for decode", stripIndex, totalStrips - 1);
        Logger.logEnd();

        char response[160];
        snprintf(response, sizeof(response),
                 "{\"success\":true,\"strip_index\":%d,\"strip_count\":%d,\"complete\":%s}",
                 stripIndex, totalStrips, (stripIndex == totalStrips - 1) ? "true" : "false");
        request->send(200, "application/json", response);
    }
}

// ===== Public API =====

void image_api_init(const ImageApiConfig& cfg, const ImageApiBackend& backend) {
    g_cfg = cfg;
    g_backend = backend;

    image_upload_timeout_ms = g_cfg.default_timeout_ms;

    // Best-effort: reset state
    upload_state = UPLOAD_IDLE;
    pending_op_id = 0;
    pending_image_op = {nullptr, 0, false, g_cfg.default_timeout_ms, 0};

    if (current_strip_buffer) {
        image_api_free((void*)current_strip_buffer);
        current_strip_buffer = nullptr;
    }
    current_strip_size = 0;

    if (pending_strip_op.buffer) {
        image_api_free((void*)pending_strip_op.buffer);
        pending_strip_op.buffer = nullptr;
    }
    pending_strip_op = {nullptr, 0, 0, 0, 0, 0, g_cfg.default_timeout_ms, 0};

    if (image_upload_buffer) {
        image_api_free((void*)image_upload_buffer);
        image_upload_buffer = nullptr;
    }
    image_upload_size = 0;
}

void image_api_register_routes(AsyncWebServer* server) {
    // Register the more specific /strips endpoint before /image.
    server->on(
        "/api/display/image/strips",
        HTTP_POST,
        [](AsyncWebServerRequest *request) {},
        NULL,
        handleStripUpload
    );

    server->on(
        "/api/display/image",
        HTTP_POST,
        [](AsyncWebServerRequest *request) {},
        handleImageUpload
    );

    server->on("/api/display/image", HTTP_DELETE, handleImageDelete);
}

void image_api_process_pending(bool ota_in_progress) {
    static unsigned long last_processed_id = 0;

    if (upload_state != UPLOAD_READY_TO_DISPLAY || ota_in_progress) {
        return;
    }

    if (pending_op_id == last_processed_id) {
        return;
    }

    last_processed_id = pending_op_id;

    // Handle dismiss operation
    if (pending_image_op.dismiss) {
        device_telemetry_log_memory_snapshot("img dismiss");
        if (g_backend.hide_current_image) {
            g_backend.hide_current_image();
        }
        pending_image_op.dismiss = false;
        upload_state = UPLOAD_IDLE;
        return;
    }

    // Handle strip operation
    if (pending_strip_op.buffer && pending_strip_op.size > 0) {
        const uint8_t* buf = pending_strip_op.buffer;
        const size_t sz = pending_strip_op.size;
        const uint8_t strip_index = pending_strip_op.strip_index;
        const int total_strips = pending_strip_op.total_strips;

        Logger.logMessagef("Portal", "Processing strip %d/%d (%u bytes)", strip_index, total_strips - 1, (unsigned)sz);

        if (strip_index == 0) {
            device_telemetry_log_memory_snapshot("strip pre-decode");
        }

        // Initialize strip session on first strip
        if (strip_index == 0) {
            if (!g_backend.start_strip_session) {
                Logger.logMessage("Portal", "ERROR: No strip session handler");
                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                image_api_free((void*)pending_strip_op.buffer);
                pending_strip_op.buffer = nullptr;
                upload_state = UPLOAD_IDLE;
                return;
            }

            if (!g_backend.start_strip_session(pending_strip_op.image_width, pending_strip_op.image_height, 
                                                pending_strip_op.timeout_ms, pending_strip_op.start_time)) {
                Logger.logMessage("Portal", "ERROR: Failed to init strip session");
                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                image_api_free((void*)pending_strip_op.buffer);
                pending_strip_op.buffer = nullptr;
                upload_state = UPLOAD_IDLE;
                return;
            }
        }

        // Decode strip
        bool success = false;
        if (g_backend.decode_strip) {
            success = g_backend.decode_strip(buf, sz, strip_index, false);
        }

        if (strip_index == (uint8_t)(total_strips - 1)) {
            device_telemetry_log_memory_snapshot("strip post-decode");
        }

        image_api_free((void*)pending_strip_op.buffer);
        pending_strip_op.buffer = nullptr;
        pending_strip_op.size = 0;
        upload_state = UPLOAD_IDLE;

        if (!success) {
            Logger.logMessagef("Portal", "ERROR: Failed to decode strip %d", strip_index);
            device_telemetry_log_memory_snapshot("strip decode-fail");
            if (g_backend.hide_current_image) {
                g_backend.hide_current_image();
            }
        } else if (strip_index == total_strips - 1) {
            Logger.logMessagef("Portal", "\u2713 All %d strips decoded", total_strips);
        }
        return;
    }

    // Handle full image operation (fallback for full mode)
    if (pending_image_op.buffer && pending_image_op.size > 0) {
        const uint8_t* buf = pending_image_op.buffer;
        const size_t sz = pending_image_op.size;

        Logger.logMessagef("Portal", "Processing pending image (%u bytes)", (unsigned)sz);

        device_telemetry_log_memory_snapshot("img pre-decode");

        bool success = false;
        if (g_backend.start_strip_session && g_backend.decode_strip) {
            if (!g_backend.start_strip_session(g_cfg.lcd_width, g_cfg.lcd_height, pending_image_op.timeout_ms, pending_image_op.start_time)) {
                Logger.logMessage("Portal", "ERROR: Failed to init image display");
                success = false;
            } else {
                success = g_backend.decode_strip(buf, sz, 0, false);
            }
        }

        device_telemetry_log_memory_snapshot("img post-decode");

        image_api_free((void*)pending_image_op.buffer);
        pending_image_op.buffer = nullptr;
        pending_image_op.size = 0;
        upload_state = UPLOAD_IDLE;

        if (!success) {
            Logger.logMessage("Portal", "ERROR: Failed to display image");
            device_telemetry_log_memory_snapshot("img decode-fail");
            if (g_backend.hide_current_image) {
                g_backend.hide_current_image();
            }
        }
        return;
    }

    // Invalid state
    upload_state = UPLOAD_IDLE;
}

#endif // HAS_IMAGE_API
